svnum=input('enter the satellite number=');
g2s=[5;6;7;8;17;18;139;140;141;251;252;254;255;256;257;258;
    469;470;471;...
    472;473;474;509;512;513;514;515;516;859;860;861;862];
g2shift=g2s(svnum,1);
reg=-1*ones(1,10);%将1～10号寄存器的初始值设为-1
%将10号寄存器的输出作为G1码
%将10号寄存器与3号寄存器输出模二相加后反馈给1号寄存器

for i =1:1023,
    g1(i) =reg(10);
    slave1=reg(3)*reg(10);
    reg(1,2:10)=reg(1:1:9);
    reg(1)=slave1;
end

reg = -1*ones(1,10);%将1～10号寄存器的初始值设为-1
%将10号寄存器的输出作为G2码
%并将10、9、8、6、3、2寄存器输出模二相加后反馈给1号寄存器
for i=1:1023,
    g2(i) =reg(10);
    save2=reg(2)*reg(3)*reg(6)*reg(8)*reg(9)*reg(10);
    reg(1,2:10)=reg(1:1:9);
    reg(1)=save2;
end
g2tmp(1,1:g2shift)=g2(1,1023-g2shift+1:1023);
g2tmp(1,g2shift+1:1023)=g2(1,1:1023-g2shift);
g2=g2tmp;
%G1和G2卷积后得到C/A码
ss_ca=g1.*g2;
t=1:1023;
ca=ones(1,1023);
ca=ss_ca;
CA=[t;ca];
CA1=CA';

